bmourit/ArduinoCore-GD32/variants/CREALITY_422_GD32F303RE/PeripheralPins.c
/* mbed Microcontroller Library
 * Copyright (c) 2018 GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"
//#include "gd32xxyy_gpio.h"


/* Generated remapping names */
const int GD_GPIO_REMAP[] = {
    0x00000000,
#if __has_include("gd32f10x_remap.h")
#define __REMAP_NAME__(remap) GPIO_ ## remap,
#include "gd32f30x_remap.h"
#undef __REMAP_NAME__
#endif
};

enum GD_GPIO_REMAP_NAME {
    REMAP_NONE = 0U,
#if __has_include("gd32f30x_remap.h")
#define __REMAP_NAME__(remap) remap,
#include "gd32f30x_remap.h"
#undef __REMAP_NAME__
#define __REMAP_NAME__(remap) DISABLE_ ## remap = GPIO_ ## remap | (1U << 6),
#include "gd32f30x_remap.h"
#undef __REMAP_NAME__
#endif
};

/* GPIO MODE */
const int GD_GPIO_MODE[] = {
    GPIO_MODE_AIN,              /* 0 */
    GPIO_MODE_IN_FLOATING,      /* 1 */
    GPIO_MODE_IPD,              /* 2 */
    GPIO_MODE_IPU,              /* 3 */
    GPIO_MODE_OUT_OD,           /* 4 */
    GPIO_MODE_OUT_PP,           /* 5 */
    GPIO_MODE_AF_OD,            /* 6 */
    GPIO_MODE_AF_PP,            /* 7 */
};

/* GPIO SPEED */
const int GD_GPIO_SPEED[] = {
    GPIO_OSPEED_10MHZ,      /* 0 */
    GPIO_OSPEED_2MHZ,       /* 1 */
    GPIO_OSPEED_50MHZ,      /* 2 */
    GPIO_OSPEED_MAX,        /* 3 */
};

/* =====
 * Note: Commented lines are alternative possibilities which are not used per default.
 *       If you change them, you will have to know what you do
 * =====
 */

/* ADC PinMap */
const PinMap PinMap_ADC[] = {
    {PORTA_0,       ADC0, GD_PIN_FUNC_ANALOG_CH(0)}, /* ADC0_IN0 */
    //{PORTA_0_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(0)}, /* ADC1_IN0 */
    //{PORTA_0_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(0)}, /* ADC2_IN0 */
    {PORTA_1,       ADC0, GD_PIN_FUNC_ANALOG_CH(1)}, /* ADC0_IN1 */
    //{PORTA_1_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(1)}, /* ADC1_IN1 */
    //{PORTA_1_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(1)}, /* ADC2_IN1 */
    {PORTA_2,       ADC0, GD_PIN_FUNC_ANALOG_CH(2)}, /* ADC0_IN2 */
    //{PORTA_2_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(2)}, /* ADC1_IN2 */
    //{PORTA_2_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(2)}, /* ADC2_IN2 */
    {PORTA_3,       ADC0, GD_PIN_FUNC_ANALOG_CH(3)}, /* ADC0_IN3 */
    //{PORTA_3_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(3)}, /* ADC1_IN3 */
    //{PORTA_3_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(3)}, /* ADC2_IN3 */
    {PORTA_4,       ADC0, GD_PIN_FUNC_ANALOG_CH(4)}, /* ADC0_IN4 */
    //{PORTA_4_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(4)}, /* ADC1_IN4 */
    {PORTA_5,       ADC0, GD_PIN_FUNC_ANALOG_CH(5)}, /* ADC0_IN5 */
    //{PORTA_5_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(5)}, /* ADC1_IN5 */
    {PORTA_6,       ADC0, GD_PIN_FUNC_ANALOG_CH(6)}, /* ADC0_IN6 */
    //{PORTA_6_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(6)}, /* ADC1_IN6 */
    {PORTA_7,       ADC0, GD_PIN_FUNC_ANALOG_CH(7)}, /* ADC0_IN7 */
    //{PORTA_7_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(7)}, /* ADC1_IN7 */
    {PORTB_0,       ADC0, GD_PIN_FUNC_ANALOG_CH(8)}, /* ADC0_IN8 */
    //{PORTB_0_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(8)}, /* ADC1_IN8 */
    {PORTB_1,       ADC0, GD_PIN_FUNC_ANALOG_CH(9)}, /* ADC0_IN9 */
    //{PORTB_1_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(9)}, /* ADC1_IN9 */
    {PORTC_0,       ADC0, GD_PIN_FUNC_ANALOG_CH(10)}, /* ADC0_IN10 */
    //{PORTC_0_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(10)}, /* ADC1_IN10 */
    //{PORTC_0_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(10)}, /* ADC2_IN10 */
    {PORTC_1,       ADC0, GD_PIN_FUNC_ANALOG_CH(11)}, /* ADC0_IN11 */
    //{PORTC_1_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(11)}, /* ADC1_IN11 */
    //{PORTC_1_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(11)}, /* ADC2_IN11 */
    {PORTC_2,       ADC0, GD_PIN_FUNC_ANALOG_CH(12)}, /* ADC0_IN12 */
    //{PORTC_2_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(12)}, /* ADC1_IN12 */
    //{PORTC_2_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(12)}, /* ADC2_IN12 */
    {PORTC_3,       ADC0, GD_PIN_FUNC_ANALOG_CH(13)}, /* ADC0_IN13 */
    //{PORTC_3_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(13)}, /* ADC1_IN13 */
    //{PORTC_3_ALT2,  ADC2, GD_PIN_FUNC_ANALOG_CH(13)}, /* ADC2_IN13 */
    {PORTC_4,       ADC0, GD_PIN_FUNC_ANALOG_CH(14)}, /* ADC0_IN14 */
    //{PORTC_4_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(14)}, /* ADC1_IN14 */
    {PORTC_5,       ADC0, GD_PIN_FUNC_ANALOG_CH(15)}, /* ADC0_IN15 */
    //{PORTC_5_ALT1,  ADC1, GD_PIN_FUNC_ANALOG_CH(15)}, /* ADC1_IN15 */
    {ADC_TEMP,      ADC0, GD_PIN_FUNC_ANALOG_CH(16)}, /* ADC0_IN16 */
    {ADC_VREF,      ADC0, GD_PIN_FUNC_ANALOG_CH(17)}, /* ADC0_IN17 */
    {NC,   NC,    0}
};

#ifdef HAL_DAC_MODULE_ENABLED
/* DAC PinMap */
const PinMap PinMap_DAC[] = {
    {PORTA_4,       DAC0, GD_PIN_FUNC_ANALOG_CH(0)},    /* DAC_OUT0 */
    {PORTA_5,       DAC0, GD_PIN_FUNC_ANALOG_CH(1)},    /* DAC_OUT1 */
    {NC,    NC,    0}
};
#endif

/* I2C PinMap */
const PinMap PinMap_I2C_SDA[] = {
    {PORTB_7,  I2C0, GD_PIN_DATA_REMAP(PIN_MODE_AF_OD, PIN_MODE_INPUT_FLOATING, DISABLE_I2C0_REMAP)},
    {PORTB_9,  I2C0, GD_PIN_DATA_REMAP(PIN_MODE_AF_OD, PIN_MODE_INPUT_FLOATING, I2C0_REMAP)},           /* GPIO_I2C0_REMAP */
    {PORTB_11, I2C1, GD_PIN_DATA(PIN_MODE_AF_OD, PIN_MODE_INPUT_FLOATING, 0) },
    {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
    {PORTB_6,  I2C0, GD_PIN_DATA_REMAP(PIN_MODE_AF_OD, PIN_MODE_INPUT_FLOATING, DISABLE_I2C1_REMAP)},
    {PORTB_8,  I2C0, GD_PIN_DATA_REMAP(PIN_MODE_AF_OD, PIN_MODE_INPUT_FLOATING, I2C1_REMAP)},           /* GPIO_I2C1_REMAP */
    {PORTB_10, I2C1, GD_PIN_DATA(PIN_MODE_AF_OD, PIN_MODE_INPUT_FLOATING, 0)},
    {NC,    NC,    0}
};

