bmourit/ArduinoCore-GD32/variants/CREALITY_422_GD32F303RE/PeripheralPins.c
/* PWM PinMap */
const PinMap PinMap_PWM[] = {
    {PORTA_0,       TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 0, 0)},                      /* TIMER1_CH0 */
    //{PORTA_0_ALT1,  TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP1, 0, 0)},           /* TIMER1_CH0 */
    //{PORTA_0_ALT2,  TIMER4, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 0, 0)},                      /* TIMER4_CH0 */
    {PORTA_1,       TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER1_FULL_REMAP, 1, 0)},       /* TIMER1_CH1 */
    //{PORTA_1_ALT1,  TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP1, 1, 0)},           /* TIMER1_CH1 */
    //{PORTA_1_ALT2,  TIMER4, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 1, 0)},                      /* TIMER4_CH1 */
    {PORTA_2,       TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER1_FULL_REMAP, 2, 0)},       /* TIMER1_CH2 */
    //{PORTA_2_ALT1,  TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP0, 2, 0)},           /* TIMER1_CH2 */
    //{PORTA_2_ALT2,  TIMER4, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 2, 0)},                      /* TIMER4_CH2 */
    //{PORTA_3,       TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER1_FULL_REMAP, 3, 0)},       /* TIMER1_CH3 */
    //{PORTA_3_ALT1,  TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP0, 3, 0)},           /* TIMER1_CH3 */
    {PORTA_3_ALT2,  TIMER4, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 3, 0)},                      /* TIMER4_CH3 */
    {PORTA_6,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER2_FULL_REMAP, 0, 0)},       /* TIMER2_CH0 */
    //{PORTA_7,       TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 0, 1)},            /* TIMER0_CH0_ON */
    //{PORTA_7_ALT1,  TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER2_FULL_REMAP, 1, 0)},       /* TIMER2_CH1 */
    {PORTA_7_ALT2,  TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 0, 1)},                      /* TIMER7_CH0_ON */
    {PORTA_8,       TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 0, 0)},       /* TIMER0_CH0 */
    //{PORTA_8_ALT1,  TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 0, 0)},            /* TIMER0_CH0 */
    {PORTA_9,       TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 1, 0)},       /* TIMER0_CH1 */
    //{PORTA_9_ALT1,  TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 1, 0)},            /* TIMER0_CH1 */
    {PORTA_10,      TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 2, 0)},       /* TIMER0_CH2 */
    //{PORTA_10_ALT1, TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 2, 0)},            /* TIMER0_CH2 */
    {PORTA_11,      TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 3, 0)},       /* TIMER0_CH3 */
    //{PORTA_11_ALT1, TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 3, 0)},            /* TIMER0_CH3 */
    {PORTA_15,      TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP0, 0, 0)},           /* TIMER1_CH0 */
    //{PORTA_15_ALT1, TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_FULL_REMAP, 0, 0)},               /* TIMER1_CH0 */
    //{PORTB_0,       TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 1, 1)},            /* TIMER0_CH1_ON */
    {PORTB_0_ALT1,  TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER2_FULL_REMAP, 2, 0)},       /* TIMER2_CH2 */
    //{PORTB_0_ALT2,  TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_PARTIAL_REMAP, 2, 0)},            /* TIMER2_CH2 */
    //{PORTB_0_ALT3,  TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 1, 1)},                      /* TIMER7_CH1_ON */
    {PORTB_1,       TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER0_PARTIAL_REMAP, 2, 1)},            /* TIMER0_CH2_ON */
    //{PORTB_1_ALT1,  TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER2_FULL_REMAP, 3, 1)},       /* TIMER2_CH3 */
    //{PORTB_1_ALT2,  TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_PARTIAL_REMAP, 3, 0)},            /* TIMER2_CH3 */
    //{PORTB_1_ALT3,  TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 2, 1)},                      /* TIMER7_CH2_ON */
    {PORTB_3,       TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP0, 1, 0)},           /* TIMER1_CH1 */
    //{PORTB_3_ALT1,  TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_FULL_REMAP, 1, 0)},               /* TIMER1_CH1 */
    {PORTB_4,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_PARTIAL_REMAP, 0, 0)},            /* TIMER2_CH0 */
    {PORTB_5,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_PARTIAL_REMAP, 1, 0)},            /* TIMER2_CH1 */
    {PORTB_6,       TIMER3, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER3_REMAP, 0, 0)},            /* TIMER3_CH0 */
    {PORTB_7,       TIMER3, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER3_REMAP, 1, 0)},            /* TIMER3_CH1 */
    {PORTB_8,       TIMER3, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER3_REMAP, 2, 0)},            /* TIMER3_CH2 */
    {PORTB_9,       TIMER3, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER3_REMAP, 3, 0)},            /* TIMER3_CH3 */
    {PORTB_10,      TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP1, 2, 0)},           /* TIMER1_CH2 */
    //{PORTB_10_ALT1, TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_FULL_REMAP, 2, 0)},               /* TIMER1_CH2 */
    {PORTB_11,      TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_PARTIAL_REMAP1, 3, 0)},           /* TIMER1_CH3 */
    //{PORTB_11_ALT1, TIMER1, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER1_FULL_REMAP, 3, 0)},               /* TIMER1_CH3 */
    {PORTB_13,      TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 0, 1)},       /* TIMER0_CH0_ON */
    {PORTB_14,      TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 1, 1)},       /* TIMER0_CH1_ON */
    {PORTB_15,      TIMER0, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_TIMER0_FULL_REMAP, 2, 1)},       /* TIMER0_CH2_ON */
    {PORTC_6,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_FULL_REMAP, 0, 0)},               /* TIMER2_CH0 */
    //{PORTC_6_ALT,   TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 0, 0)},                      /* TIMER7_CH0 */
    {PORTC_7,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_FULL_REMAP, 1, 0)},               /* TIMER2_CH1 */
    //{PORTC_7_ALT,   TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 1, 0)},                      /* TIMER7_CH1 */
    //{PORTC_8,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_FULL_REMAP, 2, 0)},               /* TIMER2_CH2 */
    {PORTC_8_ALT,   TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 2, 0)},                      /* TIMER7_CH2 */
    {PORTC_9,       TIMER2, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, TIMER2_FULL_REMAP, 3, 0)},               /* TIMER2_CH3 */
    //{PORTC_9_ALT,   TIMER7, GD_PIN_DATA_EXT_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE, 3, 0)},                      /* TIMER7_CH3 */
    {NC,    NC,    0}
};

/* USART PinMap */
const PinMap PinMap_UART_TX[] = {
    {PORTA_2,       USART1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_USART1_REMAP)},        /* USART1_TX */
    {PORTA_9,       USART0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_USART0_REMAP)},        /* USART0_TX */
    {PORTB_6,       USART0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, USART0_REMAP)},                /* USART0_TX */
    {PORTB_10,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART2_TX */
    {PORTC_10,      UART3, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                   /* UART3_TX */
    //{PORTC_10_ALT,  USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, USART2_PARTIAL_REMAP)},      /* USART2_TX */
    {PORTC_12,      UART4, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                   /* UART4_TX */
    {NC,    NC,     0}
};

const PinMap PinMap_UART_RX[] = {
    {PORTA_3,       USART1, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, DISABLE_USART1_REMAP)},        /* USART1_RX */
    {PORTA_10,      USART0, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, DISABLE_USART0_REMAP)},        /* USART0_RX */
    {PORTB_7,       USART0, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, USART0_REMAP)                  /* USART0_RX */
    {PORTB_11,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART2_RX */
    {PORTC_11,      UART3, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, REMAP_NONE)                     /* UART3_RX */
    //{PORTC_11_ALT,  USART2, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, USART2_PARTIAL_REMAP)},      /* USART2_RX */
    {PORTD_2,       UART4, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_PU, REMAP_NONE)},                   /* UART4_RX */
    {NC,    NC,     0}
};

